app/views/users/index.html.erb

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 1
SELECT "articles".* FROM "articles" WHERE "articles"."source_id" = 1
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 1 LIMIT 1
---

  <% user.subscriptions.each do |s| %>
    <%= s.source.name %>
    <% s.source.articles.each do |a| %>