app/controllers/articles_controller.rb

class ArticlesController < ApplicationController
  # GET /articles
  # GET /articles.json
  def index
    if(params[:user])
      	@subscriptions = User.where("email=?", params[:user][:email]).first.subscriptions
      	@articles = []
        last_sync_time = parse_date(params[:time])
     	@subscriptions.each do |s|
			@articles.push({name: s.source.name, feed: s.source.articles})#.where("created_at > ?", last_sync_time)})
		end
		respond_to do |format|
			format.html # index.html.erb
			format.json { render json: @articles }
		end
    else
		@articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE "articles"."source_id" = 1
SELECT "sources".* FROM "sources" WHERE "sources"."id" = 1 LIMIT 1
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = 1
SELECT "users".* FROM "users" WHERE (email='test@user.com') LIMIT 1
SELECT "articles".* FROM "articles" LIMIT 1

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("author", "created_at", "file_path", "preview", "published", "title", "updated", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "source_id" = 2, "file_path" = '', "updated_at" = '2013-08-04 01:53:53.231017' WHERE "articles"."id" = 4