app/controllers/subscriptions_controller.rb

  def index
    @subscriptions = Subscription.all
---
SELECT "subscriptions".* FROM "subscriptions"

  def show
    @subscription = Subscription.find(params[:id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
	inputs = params[:subscription]
    @subscription = Subscription.new(params[:subscription])

    respond_to do |format|
      if @subscription.save
---
INSERT INTO "subscriptions" ("created_at", "source_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 04 Aug 2013 01:41:09 UTC +00:00], ["source_id", 1], ["updated_at", Sun, 04 Aug 2013 01:41:09 UTC +00:00], ["user_id", 1]]